class upcycle {
    constructor(title, description, details, link) {
      this.title = title;
      this.description = description;
      this.details = details;
      this.link = link;
    }
  }
  
  const quizup = {
    131: new upcycle(
      "โมบายดอกไม้จากขวดพลาสติก",
      "1 ชั่วโมง",
      "ขวดพลาสติกใช้แล้ว (ล้างทำความสะอาดให้เรียบร้อย) กาว กระดาษทิชชู่ ฟอยล์อลูมิเนียม เชือก 1. ล้างขวดเครื่องดื่มและถอดฝาออก 2.ตัดบริเวณส่วนบนของขวาดพลาสติกให้เป็นรูปทรงดอกไม้ หรือรูปทรงต่าง ๆ 1. ทำการตกแต่งดอกไม้ด้วยการทาสี ทิ้งให้แห้ง สำหรับนำไปประกอบเป็นโมบาย 2. หุ้มบริเวณคอขวดพลาสติกด้วยเทป หรือกระดาษฟอยล์อลูมิเนียมให้แน่น",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    231: new upcycle(
      "โมบายดอกไม้จากขวดพลาสติก",
      "1 ชั่วโมง",
      "ขวดพลาสติกใช้แล้ว (ล้างทำความสะอาดให้เรียบร้อย) กาว กระดาษทิชชู่ ฟอยล์อลูมิเนียม เชือก 1. ล้างขวดเครื่องดื่มและถอดฝาออก 2.ตัดบริเวณส่วนบนของขวาดพลาสติกให้เป็นรูปทรงดอกไม้ หรือรูปทรงต่าง ๆ 1. ทำการตกแต่งดอกไม้ด้วยการทาสี ทิ้งให้แห้ง สำหรับนำไปประกอบเป็นโมบาย 2. หุ้มบริเวณคอขวดพลาสติกด้วยเทป หรือกระดาษฟอยล์อลูมิเนียมให้แน่น",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    331: new upcycle(
      "โมบายดอกไม้จากขวดพลาสติก",
      "1 ชั่วโมง",
      "ขวดพลาสติกใช้แล้ว (ล้างทำความสะอาดให้เรียบร้อย) กาว กระดาษทิชชู่ ฟอยล์อลูมิเนียม เชือก 1. ล้างขวดเครื่องดื่มและถอดฝาออก 2.ตัดบริเวณส่วนบนของขวาดพลาสติกให้เป็นรูปทรงดอกไม้ หรือรูปทรงต่าง ๆ 1. ทำการตกแต่งดอกไม้ด้วยการทาสี ทิ้งให้แห้ง สำหรับนำไปประกอบเป็นโมบาย 2. หุ้มบริเวณคอขวดพลาสติกด้วยเทป หรือกระดาษฟอยล์อลูมิเนียมให้แน่น",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    121: new upcycle(
      "อิฐรักษ์โลก",
      "30 นาที",
      "ขยะพลาสติก ขวดพลาสติก กรรไกร ไม้ กาว 1. ล้างทำความสะอาดขวดพลาสติกและ เช็ดวัสดุพลาสติกทั้งหมดให้แห้ง เพื่อป้องกันเชื้อราภายในขวด 2. สำหรับถุงหรือขยะพลาสติก นำไปทำความสะอาดและตากให้แห้งเช่นกัน",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    221: new upcycle(
      "อิฐรักษ์โลก",
      "30 นาที",
      "ขยะพลาสติก ขวดพลาสติก กรรไกร ไม้ กาว 1. ล้างทำความสะอาดขวดพลาสติกและ เช็ดวัสดุพลาสติกทั้งหมดให้แห้ง เพื่อป้องกันเชื้อราภายในขวด 2. สำหรับถุงหรือขยะพลาสติก นำไปทำความสะอาดและตากให้แห้งเช่นกัน",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    321: new upcycle(
      "อิฐรักษ์โลก",
      "30 นาที",
      "ขยะพลาสติก ขวดพลาสติก กรรไกร ไม้ กาว 1. ล้างทำความสะอาดขวดพลาสติกและ เช็ดวัสดุพลาสติกทั้งหมดให้แห้ง เพื่อป้องกันเชื้อราภายในขวด 2. สำหรับถุงหรือขยะพลาสติก นำไปทำความสะอาดและตากให้แห้งเช่นกัน",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    132: new upcycle(
      "เสื่อจากหลอดพลาสติก",
      "1 ชั่วโมง",
      "กรรไกร หลอดพลาสติกใช้แล้ว สบู่ 1. ทำความสะอาดหลอดพลาสติกโดยการแช่ในน้ำสบู่ 2. ล้างและปล่อยให้หลอดพลาสติกแห้งอย่างน้อย 30 นาที",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    232: new upcycle(
      "เสื่อจากหลอดพลาสติก",
      "1 ชั่วโมง",
      "กรรไกร หลอดพลาสติกใช้แล้ว สบู่ 1. ทำความสะอาดหลอดพลาสติกโดยการแช่ในน้ำสบู่ 2. ล้างและปล่อยให้หลอดพลาสติกแห้งอย่างน้อย 30 นาที",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    332: new upcycle(
      "เสื่อจากหลอดพลาสติก",
      "1 ชั่วโมง",
      "กรรไกร หลอดพลาสติกใช้แล้ว สบู่ 1. ทำความสะอาดหลอดพลาสติกโดยการแช่ในน้ำสบู่ 2. ล้างและปล่อยให้หลอดพลาสติกแห้งอย่างน้อย 30 นาที",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    111: new upcycle(
      "ขวดสำหรับเพาะต้นกล้า ",
      "15 นาที",
      "ถ้วยโยเกิร์ต ถุงชาที่ใช้แล้ว เมล็ดพันธุ์พืช กระดาษทิชชู่ 1. ทำความสะอาดถ้วยโยเกิร์ตโดยล้างด้วยน้ำสบู่ 2. รอจนถ้วยโยเกิร์ตแห้งสนิท",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    211: new upcycle(
      "ที่คั่นหนังสือ",
      "15 นาที",
      "กระดาษแข็ง นิตยสารที่ไม่ใช้แล้ว กรรไกร กาว",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    311: new upcycle(
      "บัวรดน้ำ",
      "15 นาที",
      "ขวดพลาสติกมีฝาปิด ตะปู น้ำสบู่สำหรับทำความสะอาด  1. ทำความสะอาดขวดโดยล้างด้วยน้ำสบู่ 2.รอจนขวดแห้งสนิท",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    121: new upcycle(
      "โคมไฟจากกล่องนม ",
      "30 นาที",
      "กรรไกรและกาว ดินสอ ปากกา หรือปากกามาร์คเกอร์ ไม้บรรทัด เชือกหรือเส้นด้าย ฟองน้ำ เข็มหรืออุปกรณ์สำหรับเจาะรูร้อยเชือก ดวงไฟ/หลอดไฟสำหรับประดับ ไม้ หรือราวแขวน สำหรับแขวนโมบาย 1. ล้างกล่องนมให้สะดวก และรอให้แห้ง 2. ทำการตัดบริเวณส่วนบนของกล่องนมออก 3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนมเข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน 4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม 5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง 6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย 7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    221: new upcycle(
      "โคมไฟจากกล่องนม ",
      "30 นาที",
      "กรรไกรและกาว ดินสอ ปากกา หรือปากกามาร์คเกอร์ ไม้บรรทัด เชือกหรือเส้นด้าย ฟองน้ำ เข็มหรืออุปกรณ์สำหรับเจาะรูร้อยเชือก ดวงไฟ/หลอดไฟสำหรับประดับ ไม้ หรือราวแขวน สำหรับแขวนโมบาย 1. ล้างกล่องนมให้สะดวก และรอให้แห้ง 2. ทำการตัดบริเวณส่วนบนของกล่องนมออก 3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนมเข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน 4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม 5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง 6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย 7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    321: new upcycle(
      "โคมไฟจากกล่องนม ",
      "30 นาที",
      "กรรไกรและกาว ดินสอ ปากกา หรือปากกามาร์คเกอร์ ไม้บรรทัด เชือกหรือเส้นด้าย ฟองน้ำ เข็มหรืออุปกรณ์สำหรับเจาะรูร้อยเชือก ดวงไฟ/หลอดไฟสำหรับประดับ ไม้ หรือราวแขวน สำหรับแขวนโมบาย 1. ล้างกล่องนมให้สะดวก และรอให้แห้ง 2. ทำการตัดบริเวณส่วนบนของกล่องนมออก 3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนมเข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน 4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม 5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง 6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย 7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    341: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว Eกรรไกร",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    342: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว Eกรรไกร",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    141: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว Eกรรไกร",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    142: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว Eกรรไกร",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    241: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว Eกรรไกร",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    ),
    242: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว Eกรรไกร",
      "https://www.img.in.th/images/1c5ec41fcf3fb3e49f47644cb12a863f.png"
    )
  };
  