class upcycle {
    constructor(title, description, details, prepare, howto) {
      this.title = title;
      this.description = description;
      this.details = details;
      this.prepare = prepare;
      this.howto = howto;
    }
  }
  
  const quizup = {
    131: new upcycle(
      "โมบายดอกไม้จากขวดพลาสติก",
      "1 ชั่วโมง",
      "ขวดพลาสติกใช้แล้ว (ล้างทำความสะอาดให้เรียบร้อย) กาว กระดาษทิชชู่ ฟอยล์อลูมิเนียม เชือก",
      "1. ล้างขวดเครื่องดื่มและถอดฝาออก 2.ตัดบริเวณส่วนบนของขวาดพลาสติกให้เป็นรูปทรงดอกไม้ หรือรูปทรงต่าง ๆ 3. ทำการตกแต่งดอกไม้ด้วยการทาสี ทิ้งให้แห้ง สำหรับนำไปประกอบเป็นโมบาย 4. หุ้มบริเวณคอขวดพลาสติกด้วยเทป หรือกระดาษฟอยล์อลูมิเนียมให้แน่น",
      "1. โมบายดอกไม้ เกิดจากการที่นำดอกไม้พลาสติกมาร้อยต่อกันทีละดอก โดยผู้ทำสามารถกำหนดตำแหน่งของดอกไม้ และขนาดของโมบายได้ตามใจชอบ \
      2. นำเชือกที่มีมาผูกให้เป็นปม ก่อนจะร้อยเชือกผ่านฝาขวดที่หุ้มด้วย \
      กระดาษฟอยล์หรือเทป ปมที่เชือกจะเป็นตัวยึดตำแหน่งของดอกไม้ ไม่ให้ขยับขึ้นลง \
      3. หลังจากได้ตำแหน่งของดอกไม้ดอกแรกแล้ว ใช้วิธีเดิมในการร้อยดอกไม้ \
      พลาสติกดอกต่อไป จนได้ความยาวที่พอใจ \
      4. เมื่อได้โมบายดอกไม้แล้ว นำไปติดกับกิ่งไม้ หรือแขวนกับเดือย \
      ยึดติดผนังเพื่อความสวยงาม"
    ),
    231: new upcycle(
      "โมบายดอกไม้จากขวดพลาสติก",
      "1 ชั่วโมง",
      "ขวดพลาสติกใช้แล้ว (ล้างทำความสะอาดให้เรียบร้อย) กาว กระดาษทิชชู่ ฟอยล์อลูมิเนียม เชือก",
      "1. ล้างขวดเครื่องดื่มและถอดฝาออก 2.ตัดบริเวณส่วนบนของขวาดพลาสติกให้เป็นรูปทรงดอกไม้ หรือรูปทรงต่าง ๆ 3. ทำการตกแต่งดอกไม้ด้วยการทาสี ทิ้งให้แห้ง สำหรับนำไปประกอบเป็นโมบาย 4. หุ้มบริเวณคอขวดพลาสติกด้วยเทป หรือกระดาษฟอยล์อลูมิเนียมให้แน่น",
      "1. โมบายดอกไม้ เกิดจากการที่นำดอกไม้พลาสติกมาร้อยต่อกันทีละดอก โดยผู้ทำสามารถกำหนดตำแหน่งของดอกไม้ และขนาดของโมบายได้ตามใจชอบ \
      2. นำเชือกที่มีมาผูกให้เป็นปม ก่อนจะร้อยเชือกผ่านฝาขวดที่หุ้มด้วย \
      กระดาษฟอยล์หรือเทป ปมที่เชือกจะเป็นตัวยึดตำแหน่งของดอกไม้ ไม่ให้ขยับขึ้นลง \
      3. หลังจากได้ตำแหน่งของดอกไม้ดอกแรกแล้ว ใช้วิธีเดิมในการร้อยดอกไม้ \
      พลาสติกดอกต่อไป จนได้ความยาวที่พอใจ \
      4. เมื่อได้โมบายดอกไม้แล้ว นำไปติดกับกิ่งไม้ หรือแขวนกับเดือย \
      ยึดติดผนังเพื่อความสวยงาม"
    ),
    331: new upcycle(
      "โมบายดอกไม้จากขวดพลาสติก",
      "1 ชั่วโมง",
      "ขวดพลาสติกใช้แล้ว (ล้างทำความสะอาดให้เรียบร้อย) กาว กระดาษทิชชู่ ฟอยล์อลูมิเนียม เชือก",
      "1. ล้างขวดเครื่องดื่มและถอดฝาออก 2.ตัดบริเวณส่วนบนของขวาดพลาสติกให้เป็นรูปทรงดอกไม้ หรือรูปทรงต่าง ๆ 3. ทำการตกแต่งดอกไม้ด้วยการทาสี ทิ้งให้แห้ง สำหรับนำไปประกอบเป็นโมบาย 4. หุ้มบริเวณคอขวดพลาสติกด้วยเทป หรือกระดาษฟอยล์อลูมิเนียมให้แน่น",
      "1. โมบายดอกไม้ เกิดจากการที่นำดอกไม้พลาสติกมาร้อยต่อกันทีละดอก โดยผู้ทำสามารถกำหนดตำแหน่งของดอกไม้ และขนาดของโมบายได้ตามใจชอบ \
      2. นำเชือกที่มีมาผูกให้เป็นปม ก่อนจะร้อยเชือกผ่านฝาขวดที่หุ้มด้วย \
      กระดาษฟอยล์หรือเทป ปมที่เชือกจะเป็นตัวยึดตำแหน่งของดอกไม้ ไม่ให้ขยับขึ้นลง \
      3. หลังจากได้ตำแหน่งของดอกไม้ดอกแรกแล้ว ใช้วิธีเดิมในการร้อยดอกไม้ \
      พลาสติกดอกต่อไป จนได้ความยาวที่พอใจ \
      4. เมื่อได้โมบายดอกไม้แล้ว นำไปติดกับกิ่งไม้ หรือแขวนกับเดือย \
      ยึดติดผนังเพื่อความสวยงาม"
    ),
    221: new upcycle(
      "อิฐรักษ์โลก",
      "30 นาที",
      "ขยะพลาสติก ขวดพลาสติก กรรไกร ไม้ กาว",
      "1. ล้างทำความสะอาดขวดพลาสติกและ เช็ดวัสดุพลาสติกทั้งหมดให้แห้ง เพื่อป้องกันเชื้อราภายในขวด \
      2. สำหรับถุงหรือขยะพลาสติก นำไปทำความสะอาดและตากให้แห้งเช่นกัน",
      "1. ตัดวัสดุพลาสติกเป็นชิ้นเล็ก ๆ สำหรับอัดลงไปในขวด \
      2. ระวังอย่าให้ไม่ชิ้นส่วนที่มีคมใส่ไปในขวดพลาสติก เพราะอาจทำให้ขวดแตกทีหลังได ้\
3. ดันวัสดุพลาสติกเข้าไปในขวดผ่านทางปากขวด ใส่กาว และใช้ไม้  \
อัดพลาสติกที่ฐานให้แน่น ก่อนที่จะใส่วัสดุพลาสติกเข้าไปเพิ่ม ทำไปเรื่อย ๆ จนเต็มขวด \
4. เพิ่มวัสดุพลาสติกเข้าไปจนขวดแน่น รอให้วัสดุภายในแห้ง ก็สามารถ \
นำอิฐอีโค่ไปใช้ประโยชน์ได้ เช่น ต่อเป็นแนวกำแพง ล้อมเป็นรั้ว เป็นต้น"
    ),
    222: new upcycle(
      "อิฐรักษ์โลก",
      "30 นาที",
      "ขยะพลาสติก ขวดพลาสติก กรรไกร ไม้ กาว",
      "1. ล้างทำความสะอาดขวดพลาสติกและ เช็ดวัสดุพลาสติกทั้งหมดให้แห้ง เพื่อป้องกันเชื้อราภายในขวด \
      2. สำหรับถุงหรือขยะพลาสติก นำไปทำความสะอาดและตากให้แห้งเช่นกัน",
      "1. ตัดวัสดุพลาสติกเป็นชิ้นเล็ก ๆ สำหรับอัดลงไปในขวด \
      2. ระวังอย่าให้ไม่ชิ้นส่วนที่มีคมใส่ไปในขวดพลาสติก เพราะอาจทำให้ขวดแตกทีหลังได ้\
3. ดันวัสดุพลาสติกเข้าไปในขวดผ่านทางปากขวด ใส่กาว และใช้ไม้  \
อัดพลาสติกที่ฐานให้แน่น ก่อนที่จะใส่วัสดุพลาสติกเข้าไปเพิ่ม ทำไปเรื่อย ๆ จนเต็มขวด \
4. เพิ่มวัสดุพลาสติกเข้าไปจนขวดแน่น รอให้วัสดุภายในแห้ง ก็สามารถ \
นำอิฐอีโค่ไปใช้ประโยชน์ได้ เช่น ต่อเป็นแนวกำแพง ล้อมเป็นรั้ว เป็นต้น"
    ),
    321: new upcycle(
      "อิฐรักษ์โลก",
      "30 นาที",
      "ขยะพลาสติก ขวดพลาสติก กรรไกร ไม้ กาว",
      "1. ล้างทำความสะอาดขวดพลาสติกและ เช็ดวัสดุพลาสติกทั้งหมดให้แห้ง เพื่อป้องกันเชื้อราภายในขวด \
      2. สำหรับถุงหรือขยะพลาสติก นำไปทำความสะอาดและตากให้แห้งเช่นกัน",
      "1. ตัดวัสดุพลาสติกเป็นชิ้นเล็ก ๆ สำหรับอัดลงไปในขวด \
      2. ระวังอย่าให้ไม่ชิ้นส่วนที่มีคมใส่ไปในขวดพลาสติก เพราะอาจทำให้ขวดแตกทีหลังได ้\
3. ดันวัสดุพลาสติกเข้าไปในขวดผ่านทางปากขวด ใส่กาว และใช้ไม้  \
อัดพลาสติกที่ฐานให้แน่น ก่อนที่จะใส่วัสดุพลาสติกเข้าไปเพิ่ม ทำไปเรื่อย ๆ จนเต็มขวด \
4. เพิ่มวัสดุพลาสติกเข้าไปจนขวดแน่น รอให้วัสดุภายในแห้ง ก็สามารถ \
นำอิฐอีโค่ไปใช้ประโยชน์ได้ เช่น ต่อเป็นแนวกำแพง ล้อมเป็นรั้ว เป็นต้น"
    ),
    132: new upcycle(
      "เสื่อจากหลอดพลาสติก",
      "1 ชั่วโมง",
      "กรรไกร หลอดพลาสติกใช้แล้ว สบู่",
      "1. ทำความสะอาดหลอดพลาสติกโดยการแช่ในน้ำสบู่  \
      2. ล้างและปล่อยให้หลอดพลาสติกแห้งอย่างน้อย 30 นาที",
      "1. รีดหลอดพลาสติกให้แบนที่สุด เพื่อไล่อากาศออก \
      2. สอดปลายหลอดพลาสติกด้านหนึ่งเข้าอีกด้านหนึ่ง \
      เพื่อให้เกิดเป็นลักษณะวงรี \
      3. บีบวงให้แบนอีกครั้งเพื่อไล่อากาศ \
      4. สอดปลายหลอดเข้าไปให้ลึกเพื่อปรับขนาด โดยขนาดที่เหมาะสมของวงรีควรอยู่ที่ประมาณ 2 นิ้ว \
      5. นำส่วนของหลอดพลาสติก 4 วงมาสานต่อกันตามภาพ  จากนั้นขยับหลอดเข้าหากันให้แน่น เพื่อไม่ให้เกิดช่องว่างตรงกลาง \
      6. นำหลอดพลาสติกแต่ละวงมาสานระหว่างกันไปเรื่อย ๆ (ตามภาพ) จนกว่าจะได้ขนาดของเสื่อที่ต้องการ"
    ),
    122: new upcycle(
      "เสื่อจากหลอดพลาสติก",
      "1 ชั่วโมง",
      "กรรไกร หลอดพลาสติกใช้แล้ว สบู่",
      "1. ทำความสะอาดหลอดพลาสติกโดยการแช่ในน้ำสบู่  \
      2. ล้างและปล่อยให้หลอดพลาสติกแห้งอย่างน้อย 30 นาที",
      "1. รีดหลอดพลาสติกให้แบนที่สุด เพื่อไล่อากาศออก \
      2. สอดปลายหลอดพลาสติกด้านหนึ่งเข้าอีกด้านหนึ่ง \
      เพื่อให้เกิดเป็นลักษณะวงรี \
      3. บีบวงให้แบนอีกครั้งเพื่อไล่อากาศ \
      4. สอดปลายหลอดเข้าไปให้ลึกเพื่อปรับขนาด โดยขนาดที่เหมาะสมของวงรีควรอยู่ที่ประมาณ 2 นิ้ว \
      5. นำส่วนของหลอดพลาสติก 4 วงมาสานต่อกันตามภาพ  จากนั้นขยับหลอดเข้าหากันให้แน่น เพื่อไม่ให้เกิดช่องว่างตรงกลาง \
      6. นำหลอดพลาสติกแต่ละวงมาสานระหว่างกันไปเรื่อย ๆ (ตามภาพ) จนกว่าจะได้ขนาดของเสื่อที่ต้องการ"
    ),
    232: new upcycle(
      "เสื่อจากหลอดพลาสติก",
      "1 ชั่วโมง",
      "กรรไกร หลอดพลาสติกใช้แล้ว สบู่",
      "1. ทำความสะอาดหลอดพลาสติกโดยการแช่ในน้ำสบู่  \
      2. ล้างและปล่อยให้หลอดพลาสติกแห้งอย่างน้อย 30 นาที",
      "1. รีดหลอดพลาสติกให้แบนที่สุด เพื่อไล่อากาศออก \
      2. สอดปลายหลอดพลาสติกด้านหนึ่งเข้าอีกด้านหนึ่ง \
      เพื่อให้เกิดเป็นลักษณะวงรี \
      3. บีบวงให้แบนอีกครั้งเพื่อไล่อากาศ \
      4. สอดปลายหลอดเข้าไปให้ลึกเพื่อปรับขนาด โดยขนาดที่เหมาะสมของวงรีควรอยู่ที่ประมาณ 2 นิ้ว \
      5. นำส่วนของหลอดพลาสติก 4 วงมาสานต่อกันตามภาพ  จากนั้นขยับหลอดเข้าหากันให้แน่น เพื่อไม่ให้เกิดช่องว่างตรงกลาง \
      6. นำหลอดพลาสติกแต่ละวงมาสานระหว่างกันไปเรื่อย ๆ (ตามภาพ) จนกว่าจะได้ขนาดของเสื่อที่ต้องการ"
    ),
    332: new upcycle(
      "เสื่อจากหลอดพลาสติก",
      "1 ชั่วโมง",
      "กรรไกร หลอดพลาสติกใช้แล้ว สบู่",
      "1. ทำความสะอาดหลอดพลาสติกโดยการแช่ในน้ำสบู่  \
      2. ล้างและปล่อยให้หลอดพลาสติกแห้งอย่างน้อย 30 นาที",
      "1. รีดหลอดพลาสติกให้แบนที่สุด เพื่อไล่อากาศออก \
      2. สอดปลายหลอดพลาสติกด้านหนึ่งเข้าอีกด้านหนึ่ง \
      เพื่อให้เกิดเป็นลักษณะวงรี \
      3. บีบวงให้แบนอีกครั้งเพื่อไล่อากาศ \
      4. สอดปลายหลอดเข้าไปให้ลึกเพื่อปรับขนาด โดยขนาดที่เหมาะสมของวงรีควรอยู่ที่ประมาณ 2 นิ้ว \
      5. นำส่วนของหลอดพลาสติก 4 วงมาสานต่อกันตามภาพ  จากนั้นขยับหลอดเข้าหากันให้แน่น เพื่อไม่ให้เกิดช่องว่างตรงกลาง \
      6. นำหลอดพลาสติกแต่ละวงมาสานระหว่างกันไปเรื่อย ๆ (ตามภาพ) จนกว่าจะได้ขนาดของเสื่อที่ต้องการ"
    ),
    333: new upcycle(
      "เสื่อจากหลอดพลาสติก",
      "1 ชั่วโมง",
      "กรรไกร หลอดพลาสติกใช้แล้ว สบู่",
      "1. ทำความสะอาดหลอดพลาสติกโดยการแช่ในน้ำสบู่  \
      2. ล้างและปล่อยให้หลอดพลาสติกแห้งอย่างน้อย 30 นาที",
      "1. รีดหลอดพลาสติกให้แบนที่สุด เพื่อไล่อากาศออก \
      2. สอดปลายหลอดพลาสติกด้านหนึ่งเข้าอีกด้านหนึ่ง \
      เพื่อให้เกิดเป็นลักษณะวงรี \
      3. บีบวงให้แบนอีกครั้งเพื่อไล่อากาศ \
      4. สอดปลายหลอดเข้าไปให้ลึกเพื่อปรับขนาด โดยขนาดที่เหมาะสมของวงรีควรอยู่ที่ประมาณ 2 นิ้ว \
      5. นำส่วนของหลอดพลาสติก 4 วงมาสานต่อกันตามภาพ  จากนั้นขยับหลอดเข้าหากันให้แน่น เพื่อไม่ให้เกิดช่องว่างตรงกลาง \
      6. นำหลอดพลาสติกแต่ละวงมาสานระหว่างกันไปเรื่อย ๆ (ตามภาพ) จนกว่าจะได้ขนาดของเสื่อที่ต้องการ"
    ),
    111: new upcycle(
      "ขวดสำหรับเพาะต้นกล้า ",
      "15 นาที",
      "ถ้วยโยเกิร์ต ถุงชาที่ใช้แล้ว เมล็ดพันธุ์พืช กระดาษทิชชู่",
      "1. ทำความสะอาดถ้วยโยเกิร์ตโดยล้างด้วยน้ำสบู่ 2. รอจนถ้วยโยเกิร์ตแห้งสนิท",
      "1. หลังจากที่รอจนถ้วยโยเกิร์ตแห้งสนิทแล้ว ให้พับกระดาษทิชชู่\
      ให้พอดีกับถ้วยโยเกิร์ต ใส่ลงในก้นภาชนะแล้วพรมน้ำให้เปียกชื้น \
      2.นำถุงชาที่ใช้แล้วมาเจาะรู ก่อนจะใส่เมล็ดพันธุ์พืชลงไป \
      3. นำถุงชาไปวางบนกระดาษทิชชู่ พร้อมพรมน้ำให้ทั่ว จากนั้นปูทับด้วยกระดาษทิชชู่บาง ๆ อีกชั้นหนึ่ง \
      4. เมล็ดพันธุ์ที่อยู่ในถุงชาจะเริ่มงอกเป็นต้นกล้า เมื่อต้นกล้าสูงประมาณ \
       2 ซ.ม. สามารถเติมดินและปุ๋ยเพื่อเป็นภาชนะสำหรับเพาะต้นกล้า ก่อนจะย้ายลงสู่กระถางหรือนำไปปลูกต่อไป"
    ),
    211: new upcycle(
      "ที่คั่นหนังสือ",
      "15 นาที",
      "กระดาษแข็ง นิตยสารที่ไม่ใช้แล้ว กรรไกร กาว",
      "-",
      "1. ตัดภาพที่อยากนำมาทำเป็นที่คั่นหนังสือจากนิตยสารที่ไม่ใช้แล้ว \
      2. ตัดกระดาษแข็งเป็นรูปสี่เหลี่ยมผืนผ้าสำหรับทำเป็นที่คั่นหนังสือ \
      3. นำภาพจากนิตยสารเก่ามาติดลงบนที่กระดาษแข็ง \
      4. ภาพจากนิตยสารสามารถดัดแปลงได้ตามความชอบ เช่น ภาพของการ์ตูนที่ชอบ ศิลปิน นักร้อง ที่ชื่นชอบ"
    ),
    112: new upcycle(
      "บัวรดน้ำ",
      "15 นาที",
      "ขวดพลาสติกมีฝาปิด ตะปู น้ำสบู่สำหรับทำความสะอาด",
      "1. ทำความสะอาดขวดโดยล้างด้วยน้ำสบู่ 2.รอจนขวดแห้งสนิท",
      "1. แกะฝาขวดพลาสติกออก \
      2. เจาะฝาขวดพลาสติกด้วยตะปู ประมาณ 2-3 รู (ขึ้นอยู่กับขนาดของฝาขวด) โดยรูไม่จำเป็นต้องมีขนาดใหญ่มาก \
      3. เติมน้ำลงในขวด \
      4. ปิดฝาให้เรียบร้อย"
    ),
    312: new upcycle(
      "บัวรดน้ำ",
      "15 นาที",
      "ขวดพลาสติกมีฝาปิด ตะปู น้ำสบู่สำหรับทำความสะอาด",
      "1. ทำความสะอาดขวดโดยล้างด้วยน้ำสบู่ 2.รอจนขวดแห้งสนิท",
      "1. แกะฝาขวดพลาสติกออก \
      2. เจาะฝาขวดพลาสติกด้วยตะปู ประมาณ 2-3 รู (ขึ้นอยู่กับขนาดของฝาขวด) โดยรูไม่จำเป็นต้องมีขนาดใหญ่มาก \
      3. เติมน้ำลงในขวด \
      4. ปิดฝาให้เรียบร้อย"
    ),
    212: new upcycle(
      "บัวรดน้ำ",
      "15 นาที",
      "ขวดพลาสติกมีฝาปิด ตะปู น้ำสบู่สำหรับทำความสะอาด",
      "1. ทำความสะอาดขวดโดยล้างด้วยน้ำสบู่ 2.รอจนขวดแห้งสนิท",
      "1. แกะฝาขวดพลาสติกออก \
      2. เจาะฝาขวดพลาสติกด้วยตะปู ประมาณ 2-3 รู (ขึ้นอยู่กับขนาดของฝาขวด) โดยรูไม่จำเป็นต้องมีขนาดใหญ่มาก \
      3. เติมน้ำลงในขวด \
      4. ปิดฝาให้เรียบร้อย"
    ),
    311: new upcycle(
      "บัวรดน้ำ",
      "15 นาที",
      "ขวดพลาสติกมีฝาปิด ตะปู น้ำสบู่สำหรับทำความสะอาด",
      "1. ทำความสะอาดขวดโดยล้างด้วยน้ำสบู่ 2.รอจนขวดแห้งสนิท",
      "1. แกะฝาขวดพลาสติกออก \
      2. เจาะฝาขวดพลาสติกด้วยตะปู ประมาณ 2-3 รู (ขึ้นอยู่กับขนาดของฝาขวด) โดยรูไม่จำเป็นต้องมีขนาดใหญ่มาก \
      3. เติมน้ำลงในขวด \
      4. ปิดฝาให้เรียบร้อย"
    ),
    121: new upcycle(
      "โคมไฟจากกล่องนม ",
      "30 นาที",
      "กรรไกรและกาว ดินสอ ปากกา หรือปากกามาร์คเกอร์ ไม้บรรทัด เชือกหรือเส้นด้าย ฟองน้ำ เข็มหรืออุปกรณ์สำหรับเจาะรูร้อยเชือก ดวงไฟ/หลอดไฟสำหรับประดับ ไม้ หรือราวแขวน สำหรับแขวนโมบาย",
      "1. ล้างกล่องนมให้สะดวก และรอให้แห้ง 2. ทำการตัดบริเวณส่วนบนของกล่องนมออก 3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนมเข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน 4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม 5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง 6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย 7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย",
      "1. ล้างกล่องนมให้สะดวก และรอให้แห้ง \
      2. ทำการตัดบริเวณส่วนบนของกล่องนมออก \
      3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนม \
      เข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน \
      4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม \
      5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง \
      6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย \
      7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย"
    ),
    221: new upcycle(
      "โคมไฟจากกล่องนม ",
      "30 นาที",
      "กรรไกรและกาว ดินสอ ปากกา หรือปากกามาร์คเกอร์ ไม้บรรทัด เชือกหรือเส้นด้าย ฟองน้ำ เข็มหรืออุปกรณ์สำหรับเจาะรูร้อยเชือก ดวงไฟ/หลอดไฟสำหรับประดับ ไม้ หรือราวแขวน สำหรับแขวนโมบาย",
      "1. ล้างกล่องนมให้สะดวก และรอให้แห้ง 2. ทำการตัดบริเวณส่วนบนของกล่องนมออก 3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนมเข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน 4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม 5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง 6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย 7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย",
      "1. ล้างกล่องนมให้สะดวก และรอให้แห้ง \
      2. ทำการตัดบริเวณส่วนบนของกล่องนมออก \
      3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนม \
      เข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน \
      4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม \
      5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง \
      6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย \
      7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย"
    ),
    321: new upcycle(
      "โคมไฟจากกล่องนม ",
      "30 นาที",
      "กรรไกรและกาว ดินสอ ปากกา หรือปากกามาร์คเกอร์ ไม้บรรทัด เชือกหรือเส้นด้าย ฟองน้ำ เข็มหรืออุปกรณ์สำหรับเจาะรูร้อยเชือก ดวงไฟ/หลอดไฟสำหรับประดับ ไม้ หรือราวแขวน สำหรับแขวนโมบาย",
      "1. ล้างกล่องนมให้สะดวก และรอให้แห้ง 2. ทำการตัดบริเวณส่วนบนของกล่องนมออก 3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนมเข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน 4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม 5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง 6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย 7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย",
      "1. ล้างกล่องนมให้สะดวก และรอให้แห้ง \
      2. ทำการตัดบริเวณส่วนบนของกล่องนมออก \
      3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนม \
      เข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน \
      4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม \
      5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง \
      6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย \
      7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย"
    ),
    322: new upcycle(
      "โคมไฟจากกล่องนม ",
      "30 นาที",
      "กรรไกรและกาว ดินสอ ปากกา หรือปากกามาร์คเกอร์ ไม้บรรทัด เชือกหรือเส้นด้าย ฟองน้ำ เข็มหรืออุปกรณ์สำหรับเจาะรูร้อยเชือก ดวงไฟ/หลอดไฟสำหรับประดับ ไม้ หรือราวแขวน สำหรับแขวนโมบาย",
      "1. ล้างกล่องนมให้สะดวก และรอให้แห้ง 2. ทำการตัดบริเวณส่วนบนของกล่องนมออก 3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนมเข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน 4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม 5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง 6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย 7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย",
      "1. ล้างกล่องนมให้สะดวก และรอให้แห้ง \
      2. ทำการตัดบริเวณส่วนบนของกล่องนมออก \
      3. ใช้ดินสอและไม้บรรทัดตีกรอบ โดยวัดจากขอบของกล่องนม \
      เข้ามาประมาณ 1 นิ้ว จากนั้นทำการตัดพื้นที่ตรงกลางออกเพื่อให้เป็นช่อง ทำซ้ำไปจนครบด้านข้างทั้ง 4 ด้าน \
      4. นำกระดาษไขมาตกแต่งด้วยลวดลายต่าง ๆ จากนั้นตัดออเป็นแผ่น ให้มีขนาดเท่ากับด้านของกล่องนม \
      5. นำกระดาษติดบนกล่องนมจากด้านใน ทำไปจนครบทุกด้านและรอให้กาวแห้ง \
      6. นำหลอดไฟสำหรับประดับใส่เข้าไปในโคมไฟ และจัดระเบียบสายให้เรียบร้อย \
      7. นำเชือกมาต่อที่ด้านบนของโคมไฟ เพื่อให้เป็นที่สำหรับห้อย"
    ),
    341: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว กรรไกร",
      "-",
      "1. ใช้จานหรือเข็มทิศร่างวงกลมบนกระดาษแข็ง โดยสามารถกำหนดให้  \
      มีขนาดเล็กใหญ่ได้ตามต้องการ จากนั้นตัดกระดาษเป็นวงกลม \
      2. เลือกรูปที่ต้องการทำเป็นโมเสก หากเลือกรูปได้แล้วให้ใช้ดินสอ \
      วาดโครงร่างของรูปภาพลงบนวงกลมกระดาษแข็ง \
      3. ตัดนิตยสารเก่า แคตตาล็อก หรือกระดาษให้เป็นชิ้นส่วนสี่เหลี่ยมเล็ก ๆ เมื่อได้ชิ้นส่วนกระดาษแล้วให้ทำการแบ่งออกตามสี เช่น กองสีเขียว กองสีแดง กองสีฟ้า เพื่อให้ง่ายต่อการนำมาจัดเรียงเป็นรูปภาพ \
      4. นำเศษกระดาษมาจัดเรียงบนภาพที่ร่างเอาไว้ สามารถใช้ความคิดสร้าง- \
      สรรค์ในการเล่นกับสีหรือปรับเปลี่ยนรูปทรงได้เต็มที่ จากนั้นเมื่อ \
      จัดเรียงแล้วให้ทากาวเพื่อติดเศษกระดาษบนตำแหน่งที่ต้องการ"
    ),
    342: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว กรรไกร",
      "-",
      "1. ใช้จานหรือเข็มทิศร่างวงกลมบนกระดาษแข็ง โดยสามารถกำหนดให้  \
      มีขนาดเล็กใหญ่ได้ตามต้องการ จากนั้นตัดกระดาษเป็นวงกลม \
      2. เลือกรูปที่ต้องการทำเป็นโมเสก หากเลือกรูปได้แล้วให้ใช้ดินสอ \
      วาดโครงร่างของรูปภาพลงบนวงกลมกระดาษแข็ง \
      3. ตัดนิตยสารเก่า แคตตาล็อก หรือกระดาษให้เป็นชิ้นส่วนสี่เหลี่ยมเล็ก ๆ เมื่อได้ชิ้นส่วนกระดาษแล้วให้ทำการแบ่งออกตามสี เช่น กองสีเขียว กองสีแดง กองสีฟ้า เพื่อให้ง่ายต่อการนำมาจัดเรียงเป็นรูปภาพ \
      4. นำเศษกระดาษมาจัดเรียงบนภาพที่ร่างเอาไว้ สามารถใช้ความคิดสร้าง- \
      สรรค์ในการเล่นกับสีหรือปรับเปลี่ยนรูปทรงได้เต็มที่ จากนั้นเมื่อ \
      จัดเรียงแล้วให้ทากาวเพื่อติดเศษกระดาษบนตำแหน่งที่ต้องการ"
    ),
    141: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว กรรไกร",
      "-",
      "1. ใช้จานหรือเข็มทิศร่างวงกลมบนกระดาษแข็ง โดยสามารถกำหนดให้  \
      มีขนาดเล็กใหญ่ได้ตามต้องการ จากนั้นตัดกระดาษเป็นวงกลม \
      2. เลือกรูปที่ต้องการทำเป็นโมเสก หากเลือกรูปได้แล้วให้ใช้ดินสอ \
      วาดโครงร่างของรูปภาพลงบนวงกลมกระดาษแข็ง \
      3. ตัดนิตยสารเก่า แคตตาล็อก หรือกระดาษให้เป็นชิ้นส่วนสี่เหลี่ยมเล็ก ๆ เมื่อได้ชิ้นส่วนกระดาษแล้วให้ทำการแบ่งออกตามสี เช่น กองสีเขียว กองสีแดง กองสีฟ้า เพื่อให้ง่ายต่อการนำมาจัดเรียงเป็นรูปภาพ \
      4. นำเศษกระดาษมาจัดเรียงบนภาพที่ร่างเอาไว้ สามารถใช้ความคิดสร้าง- \
      สรรค์ในการเล่นกับสีหรือปรับเปลี่ยนรูปทรงได้เต็มที่ จากนั้นเมื่อ \
      จัดเรียงแล้วให้ทากาวเพื่อติดเศษกระดาษบนตำแหน่งที่ต้องการ"
    ),
    142: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว กรรไกร",
      "-",
      "1. ใช้จานหรือเข็มทิศร่างวงกลมบนกระดาษแข็ง โดยสามารถกำหนดให้  \
      มีขนาดเล็กใหญ่ได้ตามต้องการ จากนั้นตัดกระดาษเป็นวงกลม \
      2. เลือกรูปที่ต้องการทำเป็นโมเสก หากเลือกรูปได้แล้วให้ใช้ดินสอ \
      วาดโครงร่างของรูปภาพลงบนวงกลมกระดาษแข็ง \
      3. ตัดนิตยสารเก่า แคตตาล็อก หรือกระดาษให้เป็นชิ้นส่วนสี่เหลี่ยมเล็ก ๆ เมื่อได้ชิ้นส่วนกระดาษแล้วให้ทำการแบ่งออกตามสี เช่น กองสีเขียว กองสีแดง กองสีฟ้า เพื่อให้ง่ายต่อการนำมาจัดเรียงเป็นรูปภาพ \
      4. นำเศษกระดาษมาจัดเรียงบนภาพที่ร่างเอาไว้ สามารถใช้ความคิดสร้าง- \
      สรรค์ในการเล่นกับสีหรือปรับเปลี่ยนรูปทรงได้เต็มที่ จากนั้นเมื่อ \
      จัดเรียงแล้วให้ทากาวเพื่อติดเศษกระดาษบนตำแหน่งที่ต้องการ"
    ),
    241: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว กรรไกร",
      "-",
      "1. ใช้จานหรือเข็มทิศร่างวงกลมบนกระดาษแข็ง โดยสามารถกำหนดให้  \
      มีขนาดเล็กใหญ่ได้ตามต้องการ จากนั้นตัดกระดาษเป็นวงกลม \
      2. เลือกรูปที่ต้องการทำเป็นโมเสก หากเลือกรูปได้แล้วให้ใช้ดินสอ \
      วาดโครงร่างของรูปภาพลงบนวงกลมกระดาษแข็ง \
      3. ตัดนิตยสารเก่า แคตตาล็อก หรือกระดาษให้เป็นชิ้นส่วนสี่เหลี่ยมเล็ก ๆ เมื่อได้ชิ้นส่วนกระดาษแล้วให้ทำการแบ่งออกตามสี เช่น กองสีเขียว กองสีแดง กองสีฟ้า เพื่อให้ง่ายต่อการนำมาจัดเรียงเป็นรูปภาพ \
      4. นำเศษกระดาษมาจัดเรียงบนภาพที่ร่างเอาไว้ สามารถใช้ความคิดสร้าง- \
      สรรค์ในการเล่นกับสีหรือปรับเปลี่ยนรูปทรงได้เต็มที่ จากนั้นเมื่อ \
      จัดเรียงแล้วให้ทากาวเพื่อติดเศษกระดาษบนตำแหน่งที่ต้องการ"
    ),
    242: new upcycle(
      "กระเบื้องโมเสก จากวัสดุเหลือใช้",
      "1-1.5 ชั่วโมง",
      "นิตยสารเก่า แคตตาล็อก ปฏิทินหมดอายุ เศษกระดาษและกระดาษแข็ง เศษผ้า ฟอยล์ กระดาษห่ออมยิ้ม ฯลฯ กระดาษแข็งที่สามารถตัดวงกลม (เส้นผ่านศูนย์กลางประมาณ 20-30 ซ.ม.) กาว กรรไกร",
      "-",
      "1. ใช้จานหรือเข็มทิศร่างวงกลมบนกระดาษแข็ง โดยสามารถกำหนดให้  \
      มีขนาดเล็กใหญ่ได้ตามต้องการ จากนั้นตัดกระดาษเป็นวงกลม \
      2. เลือกรูปที่ต้องการทำเป็นโมเสก หากเลือกรูปได้แล้วให้ใช้ดินสอ \
      วาดโครงร่างของรูปภาพลงบนวงกลมกระดาษแข็ง \
      3. ตัดนิตยสารเก่า แคตตาล็อก หรือกระดาษให้เป็นชิ้นส่วนสี่เหลี่ยมเล็ก ๆ เมื่อได้ชิ้นส่วนกระดาษแล้วให้ทำการแบ่งออกตามสี เช่น กองสีเขียว กองสีแดง กองสีฟ้า เพื่อให้ง่ายต่อการนำมาจัดเรียงเป็นรูปภาพ \
      4. นำเศษกระดาษมาจัดเรียงบนภาพที่ร่างเอาไว้ สามารถใช้ความคิดสร้าง- \
      สรรค์ในการเล่นกับสีหรือปรับเปลี่ยนรูปทรงได้เต็มที่ จากนั้นเมื่อ \
      จัดเรียงแล้วให้ทากาวเพื่อติดเศษกระดาษบนตำแหน่งที่ต้องการ"
    )
  };
  